tests/fixtures/query.json

{
  "http_interactions": [
    {
      "recorded_at": "2018-02-23T21:02:51",
      "request": {
        "body": {
          "encoding": "utf-8",
          "string": "\n<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"\n    xmlns:auth=\"http://auth.cxf.wokmws.thomsonreuters.com\">\n  <soapenv:Header/>\n   <soapenv:Body>\n \t<auth:authenticate/>\n </soapenv:Body>\n</soapenv:Envelope>\n"
        },
        "headers": {
          "Accept": "*/*",
          "Accept-Encoding": "gzip, deflate",
          "Authorization": "Basic <base64 encoded WoS username:password>",
          "Connection": "keep-alive",
          "Content-Length": "235",
          "User-Agent": "python-requests/2.18.4"
        },
        "method": "POST",
        "uri": "http://search.webofknowledge.com/esti/wokmws/ws/WOKMWSAuthenticate?wsdl"
      },
      "response": {
        "body": {
          "encoding": "ISO-8859-1",
          "string": "<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body><ns2:authenticateResponse xmlns:ns2=\"http://auth.cxf.wokmws.thomsonreuters.com\"><return>8FEApdFgFw8nuwQHrFY</return></ns2:authenticateResponse></soap:Body></soap:Envelope>"
        },
        "headers": {
          "Connection": "keep-alive",
          "Content-Length": "252",
          "Content-Type": "text/xml;charset=ISO-8859-1",
          "Date": "Fri, 23 Feb 2018 21:02:51 GMT",
          "Server": "Apache-Coyote/1.1",
          "Set-Cookie": "SID=8FEApdFgFw8nuwQHrFY"
        },
        "status": {
          "code": 200,
          "message": "OK"
        },
        "url": "http://search.webofknowledge.com/esti/wokmws/ws/WOKMWSAuthenticate?wsdl"
      }
    },
    {
      "recorded_at": "2018-02-23T21:02:52",
      "request": {
        "body": {
          "encoding": "utf-8",
          "string": "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:woksearchlite=\"http://woksearchlite.v3.wokmws.thomsonreuters.com\">\n   <soapenv:Header />\n   <soapenv:Body>\n      <woksearchlite:search>\n         <queryParameters>\n         <databaseId>WOS</databaseId><userQuery>OG=\"University of Florida\"</userQuery><timeSpan><begin>2016-03-15</begin><end>2016-03-15</end></timeSpan><queryLanguage>en</queryLanguage></queryParameters>\n         <retrieveParameters>\n         <firstRecord>1</firstRecord><count>1</count></retrieveParameters>\n      </woksearchlite:search>\n   </soapenv:Body>\n</soapenv:Envelope>"
        },
        "headers": {
          "Accept": "*/*",
          "Accept-Encoding": "gzip, deflate",
          "Connection": "keep-alive",
          "Content-Length": "623",
          "Cookie": "SID=8FEApdFgFw8nuwQHrFY",
          "User-Agent": "python-requests/2.18.4"
        },
        "method": "POST",
        "uri": "http://search.webofknowledge.com/esti/wokmws/ws/WokSearchLite?wsdl"
      },
      "response": {
        "body": {
          "encoding": "ISO-8859-1",
          "string": "<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body><ns2:searchResponse xmlns:ns2=\"http://woksearchlite.v3.wokmws.thomsonreuters.com\"><return><queryId>1</queryId><recordsFound>33</recordsFound><recordsSearched>6737</recordsSearched><records><uid>WOS:000371581900197</uid><title><label>Title</label><value>Elective Neck Management for Squamous Cell Carcinoma Metastatic to the Parotid-area Lymph Nodes</value></title><doctype><label>Doctype</label><value>Meeting Abstract</value></doctype><source><label>Issue</label><value>4</value></source><source><label>Pages</label><value>932-932</value></source><source><label>Published.BiblioDate</label><value>MAR 15</value></source><source><label>Published.BiblioYear</label><value>2016</value></source><source><label>SourceTitle</label><value>INTERNATIONAL JOURNAL OF RADIATION ONCOLOGY BIOLOGY PHYSICS</value></source><source><label>Volume</label><value>94</value></source><authors><label>Authors</label><value>Herman, M. P.</value><value>Amdur, R. J.</value><value>Werning, J. W.</value><value>Dziegielewski, P. T.</value><value>Morris, C. G.</value><value>Mendenhall, W. M.</value></authors><other><label>Identifier.Eissn</label><value>1879-355X</value></other><other><label>Identifier.Ids</label><value>DF8BM</value></other><other><label>Identifier.Issn</label><value>0360-3016</value></other><other><label>Identifier.Xref_Doi</label><value>10.1016/j.ijrobp.2015.12.247</value></other><other><label>ResearcherID.Disclaimer</label><value>ResearcherID data provided by Clarivate Analytics</value></other></records></return></ns2:searchResponse></soap:Body></soap:Envelope>"
        },
        "headers": {
          "Connection": "keep-alive",
          "Content-Length": "1645",
          "Content-Type": "text/xml;charset=ISO-8859-1",
          "Date": "Fri, 23 Feb 2018 21:02:51 GMT",
          "Server": "Apache-Coyote/1.1"
        },
        "status": {
          "code": 200,
          "message": "OK"
        },
        "url": "http://search.webofknowledge.com/esti/wokmws/ws/WokSearchLite?wsdl"
      }
    },
    {
      "recorded_at": "2018-02-23T21:02:52",
      "request": {
        "body": {
          "encoding": "utf-8",
          "string": "\n<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:auth=\"http://auth.cxf.wokmws.thomsonreuters.com\">\n   <soapenv:Header/>\n   <soapenv:Body>\n      <auth:closeSession/>\n   </soapenv:Body>\n</soapenv:Envelope>\n"
        },
        "headers": {
          "Accept": "*/*",
          "Accept-Encoding": "gzip, deflate",
          "Connection": "keep-alive",
          "Content-Length": "238",
          "Cookie": "SID=8FEApdFgFw8nuwQHrFY",
          "User-Agent": "python-requests/2.18.4"
        },
        "method": "POST",
        "uri": "http://search.webofknowledge.com/esti/wokmws/ws/WOKMWSAuthenticate?wsdl"
      },
      "response": {
        "body": {
          "encoding": "ISO-8859-1",
          "string": "<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body><ns2:closeSessionResponse xmlns:ns2=\"http://auth.cxf.wokmws.thomsonreuters.com\"/></soap:Body></soap:Envelope>"
        },
        "headers": {
          "Connection": "keep-alive",
          "Content-Length": "190",
          "Content-Type": "text/xml;charset=ISO-8859-1",
          "Date": "Fri, 23 Feb 2018 21:02:52 GMT",
          "Server": "Apache-Coyote/1.1"
        },
        "status": {
          "code": 200,
          "message": "OK"
        },
        "url": "http://search.webofknowledge.com/esti/wokmws/ws/WOKMWSAuthenticate?wsdl"
      }
    }
  ],
  "recorded_with": "betamax/0.8.0"
}